marcorussi/nrf51_multi_nus_central/conn_manager.c
/* Database discovery structure */
static ble_db_discovery_t       m_ble_db_discovery;

/* Connection parameters requested for connection. */
static const ble_gap_conn_params_t m_connection_param =
{
	(uint16_t)MIN_CONNECTION_INTERVAL,   /* Minimum connection */
	(uint16_t)MAX_CONNECTION_INTERVAL,   /* Maximum connection */
	0,                                   /* Slave latency */
	(uint16_t)SUPERVISION_TIMEOUT        /* Supervision time-out */
};

/* Parameters used when scanning. */
static const ble_gap_scan_params_t m_scan_params = 
{
	.active      = SCAN_ACTIVE,
	.selective   = SCAN_SELECTIVE,
	.p_whitelist = NULL,
	.interval    = SCAN_INTERVAL,
	.window      = SCAN_WINDOW,
	.timeout     = SCAN_TIMEOUT
};

/* NUS uuid */
static const ble_uuid_t m_nus_uuid = 
{
	.uuid = BLE_UUID_NUS_SERVICE,
	.type = NUS_SERVICE_UUID_TYPE	
};

/* Found devices list */
static device_info found_devices[DEVICE_LIST_LENGTH];

/* Found devices list index */
static uint8_t devices_list_index = 0;

/* Flag to indicate if device is connected */
static conn_ke_state connection_state = CONN_KE_NOT_INIT;




/* ---------- Local functions prototypes ---------- */

static void gap_params_init(void);
static void nus_p_init(void);
static void on_conn_params_evt(ble_conn_params_evt_t *);
static void conn_params_error_handler(uint32_t);
static void conn_params_init(void);
static void on_adv_evt(ble_adv_evt_t);
static void advertising_init(void);
static void ble_nus_p_data_handler(ble_nus_t *, uint8_t *, uint16_t);
static void ble_p_evt_dispatch(ble_evt_t *);

static bool is_target_name_present(const ble_gap_evt_adv_report_t *, uint8_t *, uint8_t *);
static bool is_uuid_present(const ble_uuid_t *, const ble_gap_evt_adv_report_t *);
static uint8_t get_devices_list_id(ble_gap_addr_t);
static void on_ble_evt(ble_evt_t *);
static void ble_nus_c_evt_handler(ble_nus_c_t *, const ble_nus_c_evt_t *);
static void ble_c_evt_dispatch(ble_evt_t *);
static void ble_stack_init(bool);
static void nus_c_init(void);




/* ------------ Exported functions implementation --------------- */

/* Function to init the connection manager */
void conn_init(bool is_central)
{
    uint32_t err_code;
   
	/* if central role */
	if(is_central == true)
	{
		/* init BLE stack */
		ble_stack_init(true);

		/* init database discovery */
		err_code = ble_db_discovery_init();
		APP_ERROR_CHECK(err_code);
		
		/* init NUS client service */
		nus_c_init();

		/* connection manager initialised as central and not connected */
		connection_state = CONN_KE_INIT_C;
	}
	/* else if peripheral or any other invalid boolean values */
	else
	{
		/* init BLE stack */
		ble_stack_init(false);
		/* init GAP parameters */
		gap_params_init();
		/* init NUS peripheral service */
		nus_p_init();
		/* init advertising */
		advertising_init();
		/* init connection parameters */
		conn_params_init();

		/* start advertising */
		err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
		APP_ERROR_CHECK(err_code);

		/* connection manager initialised as peripheral and not connected */
		connection_state = CONN_KE_INIT_P;
	}
}


/* Function to get the current connection status */
conn_ke_state conn_get_state(void)
{
	return connection_state;
}


/* Function to start scanning devices */
void conn_start_scan(void)
{
	uint32_t err_code;

    err_code = sd_ble_gap_scan_start(&m_scan_params);
    APP_ERROR_CHECK(err_code);

	/* reset device list index */
	devices_list_index = 0;
}


/* Function to start scanning devices */
void conn_stop_scan(void)
{
	/* stop scanning */
	sd_ble_gap_scan_stop();
}


/* Function to request a connection to a previously found device */
bool conn_request_connection(uint8_t device_index)
{
	uint32_t err_code;
	bool success = false;

	/* if requested index (from ascii to int) is lower than num of devices */
	if(device_index < devices_list_index)
	{
		/* request a connection */
		err_code = sd_ble_gap_connect(&found_devices[device_index].gap_addr,
		                              &m_scan_params,
		                              &m_connection_param);
		if (err_code == NRF_SUCCESS)
		{	
			/* success */
			success = true;
		}
		else
		{
			/* connection fail */
		}
	}
	else
	{
		/* invalid device index */
	}

	return success;
}


/* Function to drop an ongoing connection */
bool conn_drop_connection(void)
{
	uint32_t err_code;
	bool success = false;

	/* try to disconnect */
	err_code = sd_ble_gap_disconnect(m_ble_nus_c.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    if (err_code != NRF_ERROR_INVALID_STATE)
    {
        APP_ERROR_CHECK(err_code);
		/* success */
		success = true;
    }
	else
	{
		/* fail to disconnect */ 
	}

	return success;
}


/* Function to send data through NUS central service. 
   TODO: consider to implement a timeout */
void conn_send_data_c_nus(uint8_t *p_data, uint16_t data_length)
{
	/* if data length is greater the max allowed value */
	if(data_length > MAX_DATA_LENGTH)
	{
		/* limit data length and send anyway */
		data_length = MAX_DATA_LENGTH;
	}
	else
	{
		/* length is valid, do nothing */
	}

	/* send data but do not send termination char */
	while (ble_nus_c_string_send(&m_ble_nus_c, p_data, data_length) != NRF_SUCCESS)			
	{
		/* repeat until sent */
	}
}


/* Function to send data through NUS peripheral service. 
   TODO: consider to implement a timeout */
void conn_send_data_p_nus(uint8_t *p_data, uint16_t data_length)
{
	/* if data length is greater the max allowed value */
	if(data_length > MAX_DATA_LENGTH)
	{
		/* limit data length and send anyway */
		data_length = MAX_DATA_LENGTH;
	}
	else
	{
		/* length is valid, do nothing */
	}

	/* send data but do not send termination char */
	while (ble_nus_string_send(&m_ble_nus_p, p_data, data_length) != NRF_SUCCESS)			
	{
		/* repeat until sent */
	}
}


/* send found devices info through uart*/
void conn_send_found_devices(void)
{
	uint8_t index;
	char ascii_address[12];

	app_uart_put(0x0D);
	app_uart_put(0x0A);
	for(index = 0; index < devices_list_index; index++)
	{
		app_uart_put((0x30 | index));
		app_uart_put('-');
		uart_send_string((uint8_t *)"ADDRESS:", 8);
		/* connvert and send the device address */
		util_address_to_string(found_devices[index].gap_addr.addr, ascii_address);
		uart_send_string((uint8_t *)ascii_address, 12);
		app_uart_put('-');
		uart_send_string((uint8_t *)"NAME:", 5);
		/* send device name */
		if(found_devices[index].name_length > 0)
		{
			uart_send_string(found_devices[index].name, found_devices[index].name_length);
		}
		else
		{
			uart_send_string((uint8_t *)"Unknown", 7);
		}
		app_uart_put(0x0D);
		app_uart_put(0x0A);
	}

	uart_send_string((uint8_t *)"OK ", 3);
	app_uart_put((0x30 | devices_list_index));
	app_uart_put('!');
}




/* ---------- Local functions implementation ---------- */


/* PERIPHERAL: Function for the GAP initialization.
   This function will set up all the necessary GAP (Generic Access Profile) parameters of 
   the device. It also sets the permissions and appearance */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
    
    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONNECTION_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONNECTION_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = SUPERVISION_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


