marcorussi/nrf51_multi_nus_central/conn_manager.c
        index += field_length + 1;
    }

    return false;
}


/* CENTRAL: Function for getting the device id of the found devices list.
   Parameters: gap_addr   Bluetooth low energy address.
*/
static uint8_t get_devices_list_id(ble_gap_addr_t gap_addr)
{
	uint8_t device_index = 0;

	/* check address type - TODO */
	//if(gap_addr.addr_type == BLE_GAP_ADDR_TYPE_PUBLIC)

	/* seek address in found device list */
	while( (0 != strncmp((const char *)(gap_addr.addr), (const char *)(found_devices[device_index].gap_addr.addr), (size_t)6))
	&&	   (device_index < devices_list_index) )
	{
		device_index++;
	}

	/* if the address has not been found in the list */
	if(device_index >= devices_list_index)
	{
		/* return "not found" value */
		device_index = 0xFF;
	}

	return device_index;
}


/* Function for handling the Application's BLE Stack events.
   Parameters: p_ble_evt   Bluetooth stack event.
*/
static void on_ble_evt(ble_evt_t * p_ble_evt)
{
    uint32_t err_code;
	uint8_t index = 0;
    const ble_gap_evt_t * p_gap_evt = &p_ble_evt->evt.gap_evt;	
    
    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_ADV_REPORT:
        {
            const ble_gap_evt_adv_report_t *p_adv_report = &p_gap_evt->params.adv_report;

			index = get_devices_list_id(p_adv_report->peer_addr);
			/* id device has been already found */
			if( index != 0xFF)
			{
				/* device already found */
				/* new adv update */
			}
			else
			{
				/* get last free index */
				index = devices_list_index;
				/* increment last free index */
				devices_list_index++;
				/* insert the new device into the list */
				/* copy address */
				strncpy((char *)(found_devices[index].gap_addr.addr), (char *)(p_adv_report->peer_addr.addr), (size_t)6);
				/* copy address type */
				found_devices[index].gap_addr.addr_type = p_adv_report->peer_addr.addr_type;
			}

			/* if scan response */
			//if(p_adv_report->scan_rsp == 1)
			//{
				if (is_target_name_present(p_adv_report, found_devices[index].name, &found_devices[index].name_length))
				{
					found_devices[index].valid_target |= 1;
				}	
			//}
			/* else if advertisement */
			//else
			//{
				if (is_uuid_present(&m_nus_uuid, p_adv_report))
			    {
					found_devices[index].valid_target |= 2;
				}
			//}
            break;
        }
        
        case BLE_GAP_EVT_CONNECTED:
			/* if role is central */
			if(connection_state == CONN_KE_INIT_C)
			{
				uart_send_string((uint8_t *)"CONNECTED", 9);
				/* device is connected as central to a peripheral */
				connection_state = CONN_KE_CONNECTED_C;
				/* reset uart */
				uart_reset();

		        m_ble_nus_c.conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
		        /* start discovery of services. The NUS Client waits for a discovery result */
		        err_code = ble_db_discovery_start(&m_ble_db_discovery, p_ble_evt->evt.gap_evt.conn_handle);
		        APP_ERROR_CHECK(err_code);
			}
			/* else if role is peripheral */
			else if(connection_state == CONN_KE_INIT_P)
			{
				/* device is connected as peripheral to a central */
				connection_state = CONN_KE_CONNECTED_P;

				nrf_gpio_pin_write(21, 0);
			}
			else
			{
				/* do nothing */
			}
            break;

		case BLE_GAP_EVT_DISCONNECTED:
			/* if role is peripheral */
			if(connection_state == CONN_KE_CONNECTED_P)
			{
				/* device is not connected now */
				connection_state = CONN_KE_INIT_P;
			}
			else
			{
				/* do nothing at the moment */
			}
            break;
    
        case BLE_GAP_EVT_TIMEOUT:
            if (p_gap_evt->params.timeout.src == BLE_GAP_TIMEOUT_SRC_SCAN)
            {
                /* scan timed out */
				uart_send_string((uint8_t *)"TIMEOUT", 7);
            }
            else if (p_gap_evt->params.timeout.src == BLE_GAP_TIMEOUT_SRC_CONN)
            {
                /* connection request timed out: do nothing */
            }
			else
			{
				/* do nothing */
			}
            break;
            
        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
            /* Pairing not supported */
            err_code = sd_ble_gap_sec_params_reply(p_ble_evt->evt.gap_evt.conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
			//err_code = sd_ble_gap_sec_params_reply(m_conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
            APP_ERROR_CHECK(err_code);
            break;
    
        case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:
            /* Accepting parameters requested by peer. */
            err_code = sd_ble_gap_conn_param_update(p_gap_evt->conn_handle,
                                                    &p_gap_evt->params.conn_param_update_request.conn_params);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
            // No system attributes have been stored.
            err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
            APP_ERROR_CHECK(err_code);
            break;
    
        default:
            break;
    }
}


/* CENTRAL: Callback handling NUS Client events.
   Handling events from the ble_nus_c module.
   This function is called to notify the application of NUS client events.
   Parameters: p_ble_nus_c   NUS Client Handle. This identifies the NUS client
               p_ble_nus_evt Pointer to the NUS Client event.
*/
static void ble_nus_c_evt_handler(ble_nus_c_t * p_ble_nus_c, const ble_nus_c_evt_t * p_ble_nus_evt)
{
    uint32_t err_code;
    switch (p_ble_nus_evt->evt_type)
    {
        case BLE_NUS_C_EVT_FOUND_NUS_TX_CHARACTERISTIC:
            /* TX characteristic found */
            break;
        
        case BLE_NUS_C_EVT_FOUND_NUS_RX_CHARACTERISTIC:

			//nrf_gpio_pin_write(21, 0);

	    	/* RX characteristic found: enable notification on that */
            err_code = ble_nus_c_rx_notif_enable(p_ble_nus_c);
            APP_ERROR_CHECK(err_code);
            break;
        
        case BLE_NUS_C_EVT_NUS_RX_EVT:
			/* send received data from NUS to uart interface */
            for (uint32_t i = 0; i < p_ble_nus_evt->data_len; i++)
            {
                while(app_uart_put( p_ble_nus_evt->p_data[i]) != NRF_SUCCESS);
            }
            break;
        
        case BLE_NUS_C_EVT_DISCONNECTED:
			/* device is not connected as central anymore */
			connection_state = CONN_KE_INIT_C;
			/* reset uart */
			uart_reset();
			uart_send_string((uint8_t *)"DISCONNECTED", 12);
            break;
    }
}


/* Function for handling the data from the Nordic UART Service.
   This function will process the data received from the Nordic UART BLE Service and send
   it to the UART module */
static void ble_nus_p_data_handler(ble_nus_t * p_nus, uint8_t * p_data, uint16_t length)
{

