marcorussi/nrf51_multi_nus_central/conn_manager.c
	nrf_gpio_pin_write(22, 0);

	/* send received data from NUS to uart interface */
	for (uint32_t i = 0; i < length; i++)
    {
        while(app_uart_put(p_data[i]) != NRF_SUCCESS);
    }
    app_uart_put(0x0D);
	app_uart_put(0x0A);
}


/* CENTRAL: Function for dispatching a BLE stack event to all modules with a BLE stack event handler.
   This function is called from the scheduler in the main loop after a BLE stack event has
   been received.
   Parameters: p_ble_evt   Bluetooth stack event.
*/
static void ble_c_evt_dispatch(ble_evt_t * p_ble_evt)
{
    on_ble_evt(p_ble_evt);  
    ble_db_discovery_on_ble_evt(&m_ble_db_discovery, p_ble_evt);
    ble_nus_c_on_ble_evt(&m_ble_nus_c,p_ble_evt);
}


/* PERIPHERAL: Function for dispatching a S110 SoftDevice event to all modules with a S110 SoftDevice 
   event handler.
   This function is called from the S110 SoftDevice event interrupt handler after a S110 
   SoftDevice event has been received */
static void ble_p_evt_dispatch(ble_evt_t * p_ble_evt)
{
    ble_conn_params_on_ble_evt(p_ble_evt);
    ble_nus_on_ble_evt(&m_ble_nus_p, p_ble_evt);
    on_ble_evt(p_ble_evt);
    ble_advertising_on_ble_evt(p_ble_evt);  
}


/* Function for initializing the BLE stack.
   Initializes the SoftDevice and the BLE event interrupt.
*/
static void ble_stack_init(bool is_central)
{
    uint32_t err_code;

    /* Initialize the SoftDevice handler module. */
    SOFTDEVICE_HANDLER_INIT(NRF_CLOCK_LFCLKSRC_XTAL_20_PPM, NULL);

    /* Enable BLE stack. */
    ble_enable_params_t ble_enable_params;
    memset(&ble_enable_params, 0, sizeof(ble_enable_params));

    ble_enable_params.gatts_enable_params.attr_tab_size   = BLE_GATTS_ATTR_TAB_SIZE_DEFAULT;

	/* if central role is required */
	if(is_central == true)
	{
		ble_enable_params.gatts_enable_params.service_changed = false;
	}
	/* else if peripheral role or other invalid values */
	else
	{
		ble_enable_params.gatts_enable_params.service_changed = IS_SRVC_CHANGED_CHARACT_PRESENT;
	}

	/* enable BLE */
    err_code = sd_ble_enable(&ble_enable_params);
    APP_ERROR_CHECK(err_code);

	/* if central role is required */
	if(is_central == true)
	{
		/* Register with the SoftDevice handler module for BLE events in central role */
		err_code = softdevice_ble_evt_handler_set(ble_c_evt_dispatch);
		APP_ERROR_CHECK(err_code);
	}
	/* else if peripheral role or other invalid values */
	else
	{
		/* Register with the SoftDevice handler module for BLE events in peripheral role */
		err_code = softdevice_ble_evt_handler_set(ble_p_evt_dispatch);
		APP_ERROR_CHECK(err_code);
	}
}


/* PERIPHERAL: Function for initializing services that will be used by the application */
static void nus_p_init(void)
{
    uint32_t       err_code;
    ble_nus_init_t nus_p_init_t;
    
    memset(&nus_p_init_t, 0, sizeof(nus_p_init_t));

    nus_p_init_t.data_handler = ble_nus_p_data_handler;
    
    err_code = ble_nus_init(&m_ble_nus_p, &nus_p_init_t);
    APP_ERROR_CHECK(err_code);
}


/* Function for initializing the NUS Client. */
static void nus_c_init(void)
{
    uint32_t         err_code;
    ble_nus_c_init_t nus_c_init_t;
    
    nus_c_init_t.evt_handler = ble_nus_c_evt_handler;
    
    err_code = ble_nus_c_init(&m_ble_nus_c, &nus_c_init_t);
    APP_ERROR_CHECK(err_code);
}





/* End of file */



